//
//  FruitData.swift
//  Fruits&Veggies
//
//  Created by Hristo on 05.11.2023.
//

import SwiftUI
import SwiftData

// (fruit: fruitsData[...])
// MARK: -FRUITS DATA
// func Fruits() {
    
    let fruitsData: [Fruit] = [
        Fruit(
            title: "Ябълка",
            headline: "Ябълките са един от най-популярните и изключително здравословни плодове с добра причина.",
            image: "apple",
            gradientColor: "autumn",
            content: """
        Ябълките съдържат ключови хранителни вещества, включително фибри и антиоксиданти. Те могат да предложат ползи за здравето, включително понижаване
        на нивата на кръвната захар и благоприятно въздействие върху здравето на сърцето.

        """,
            co2: """
            
            Карбонов Отпечатък:
            
            50 000 тона
            
            Причината да е толкова нисък, защото България предоставя условия за голямо пройзводство на ябълки.
            """,
            nutrition: ["218 kJ (52 kcal)","10.39 g","0.17 g","0.26 g","A, B1, B2, B3, B5, B6, B9, C, E, K","Calcium, Iron, Magnasium, Manganese, Phosphorus, Potassium, Sodium, Zinc"]
        ),
        Fruit(
            title: "Круша",
            headline: "Сладки плодове с форма на камбанка, които са се наслаждавали от древни времена. Могат да се консумират хрупкави или меки.",
            image: "pear",
            gradientColor: "autumn",
            content: """
        Крушите са особено богати на фолат, витамин С, мед и калий. Те също са добър източник на полифенолни антиоксиданти. Крушите са отличен източник на разтворими и неразтворими фибри, които са от съществено значение за здравето на храносмилането. Тези влакна помагат за поддържане на редовността на червата чрез омекотяване и увеличаване на обема на изпражненията.
        
        """,
            co2: """
            Карбонов отпечатък:
                            
            65 000 тона
                            
            Това е добра стойност на карбоновия отпечатък от препоръчителна за плодове и зеленчуци - 120 000 тона. България пройзвежда голямо количество от вкусни
        круши.

        """,
            nutrition: ["239 kJ (57 kcal)","9.75 g","0.14 g","0.36 g","B1, B2, B3, B5, B6, B9, C, E, K","Calcium, Iron, Magnasium, Manganese, Phosphorus, Potassium, Sodium, Zinc"]
        ),
        Fruit(
            title: "Грейпфрут",
            headline: "Грейпфрутът е цитрусов плод с вкус, който може да варира от горчиво-сладък до кисел.",
            image: "grapefruit",
            gradientColor: "autumn",
            content: """
        Грейпфрутът е с ниско съдържание на калории и осигурява значително количество фибри, витамини, минерали и антиоксиданти. Грейпфрутът може да е от полза за вашата имунна система. Съдържа няколко витамина и минерала, известни с ролята си в защитата на тялото срещу инфекции.
        """,
            co2: """
                    
            Карбонов отпечатък:
                                   
            300 000 тона
                                   
            Това е доста висока стойност на карбоновия отпечатък от препоръчителна за плодове и зеленчуци - 120 000 тона. България пройзвежда много малък брой
            грейпфрут - 2.0 % пройзвежда.
            """,
            nutrition: ["138 kJ (33 kcal)","7.31 g","0.10 g","0.8 g","B1, B2, B3, B5, B6, B9, C, E","Calcium, Iron, Magnasium, Manganese, Phosphorus, Potassium, Zinc"]
        ),
        Fruit(
            title: "Слива",
            headline: "Сливите са много питателен плод. Отличен източник на витамини, минерали, фибри и антиоксиданти.",
            image: "plum",
            gradientColor: "autumn",
            content: """
        Сливите съдържат фибри и антиоксиданти. Те могат да помогнат за намаляване на запека и да са от полза за цялостното ви здраве.Сливите са с високо съдържание на полифенолни антиоксиданти, които могат да намалят възпалението и риска от няколко хронични заболявания.
        """,
            co2: """
                        
            Карбонов отпечатък:
                        
            55 000 тона
                        
            Това е доста добра стойност на карбоновия отпечатък от препоръчителна за плодове и зеленчуци - 120 000 тона. България пройзвежда много голямо количество от сливи.
            """,
            nutrition: ["192 kJ (46 kcal)","9.92 g","0.28 g","0.7 g","A, B1, B2, B3, B5, B6, B9, C, E, K","Calcium, Iron, Magnasium, Manganese, Phosphorus, Potassium, Sodium, Zinc"]
        ),
        Fruit(
            title: "Нар",
            headline: "Сладки плодове с форма на камбанка, които са се наслаждавали от древни времена. Могат да се консумират хрупкави или меки.",
            image: "pomegranate",
            gradientColor: "autumn",
            content: """
        Наровете са с ниско съдържание на калории и мазнини, но с високо съдържание на фибри, витамини и минерали. Ползите включват антиоксиданти, здраве на сърцето, здравето на урината, издръжливост при упражнения и др.Въпреки че са необходими повече изследвания, нарът съдържа съединения, които могат да помогнат за предотвратяване на хронично възпаление, свързано с болест.
        """,
            co2: """
            
            Карбонов отпечатък:
            
            150 000 тона
            
            Това е леко висока стойност на карбоновия отпечатък от  препоръчителна за плодове и зеленчуци - 120 000 тона. България не е много голям пройзводител на
            нарове.
            """,
            nutrition: ["346 kJ (83 kcal)","13.67 g","1.17 g","1.67 g","B1, B2, B3, B5, B6, B9, C, E, K","Calcium, Iron, Magnasium, Manganese, Phosphorus, Potassium, Sodium, Zinc"]
        ),
        Fruit(
            title: "Боровинка",
            headline: "Боровинките са сладки, питателни и изключително популярни плодове по целия свят.",
            image: "blueberry",
            gradientColor: "autumn",
            content: """
        Боровинката е много популярно зрънце. Той е с ниско съдържание на калории, но с високо съдържание на фибри, витамин С и витамин К. Няколко проучвания показват, че боровинките и сокът от боровинки намаляват увреждането на ДНК, което е водещ двигател на стареенето и рака.
        """,
            co2: """
            
            Карбонов отпечатък:
                            
            82 000 тона
                        
            Това е добра стойност на карбоновия отпечатък от препоръчителна за плодове и зеленчуци - 120 000 тона. България пройзвежда голямо количество от боровинки.
            """,
            nutrition: ["240 kJ (57 kcal)","9.96 g","0.33 g","0.74 g","A, B1, B2, B3, B5, B6, B9, C, E, K","Calcium, Iron, Magnasium, Manganese, Phosphorus, Sodium, Zinc"]
        ),
        Fruit(
            title: "Ягода",
            headline: "Широко ценен заради характерния си аромат, червен цвят, сочна текстура и сладост.",
            image: "strawberry",
            gradientColor: "autumn",
            content: """
        Въглехидратите в ягодите се състоят главно от фибри и прости захари. Те имат сравнително нисък ГИ и не трябва да причиняват големи скокове в нивата на кръвната захар. Ягодите могат да намалят риска от сърдечни заболявания и рак, както и да помогнат за регулирането на кръвната захар.
        """,
            co2: """
            
            Карбонов отпечатък:
                            
            76 000 тона
                            
            Това е доста добра стойност на карбоновия отпечатък за разлика от други плодове. България пройзвежда голямо количество от вкусни шгодки - червени и сладки.
            """,
            nutrition: ["136 kJ (33 kcal)","4.89 g","0.3 g","0.67 g","B1, B2, B3, B5, B6, B9, Choline, C, E, K","Calcium, Iron, Magnasium, Manganese, Phosphorus, Potassium, Sodium, Zinc"]
        ),
        Fruit(
            title: "Череша",
            headline: "Черешите са едни от най-обичаните плодове и има защо. Те са вкусни и съдържат витамини, минерали и растителни съединения със силно въздействие върху здравето.",
            image: "cherry",
            gradientColor: "autumn",
            content: """
        Черешите са добри източници на витамин С, калий, фибри и други хранителни вещества, от които тялото ви се нуждае да функционира оптимално. Всички череши са
        с високо съдържание антиоксиданти и противовъзпалителни съединения, които могат да намалят хроничните заболявания риск и насърчаване на цялостното здраве.
        Консумирането на череши, особено тръпчивите черешови продукти, като сок и прах, могат да подобрят спорта производителност и намаляване на причинените от
        упражнения мускулни увреждания и болезненост.
        """,
            co2: """
            
            Карбонов отпечатък:
                            
            54 000 тона
                            
            Това е ниска стойност на карбоновия отпечатък от препоръчителна за плодове и зеленчуци - 120 000 тона. България пройзвежда голямо количество от череши, поради добрите й климатични условия.
            """,
            nutrition: ["209 kJ (50 kcal)","8.5 g","0.3 g","1 g","A, B1, B2, B3, B5, B6, B9, C, K","Calcium, Iron, Magnasium, Manganese, Phosphorus, Potassium, Sodium, Zinc"]
        ),
        Fruit(
            title: "Диня",
            headline: "Динята е голям, сладък плод, произхождащ от Южна Африка. Свързан е с пъпеш, тиквички, тиква и краставица.",
            image: "watermelon",
            gradientColor: "autumn",
            content: """
        Високото съдържание на вода в динята може да ви помогне да останете хидратирани - което поддържа цялостното ви здраве - както и да се чувствате сити. Динята
        може да се похвали с множество хранителни вещества, включително значително количество витамини А и С. Освен това предлага антиоксиданти като ликопен и
        кукурбитацин Е. Динята съдържа растителни съединения, които могат да се борят с определени форми на рак. Необходими са обаче повече проучвания. Ликопенът и
        цитрулинът в динята могат да поддържат здравето на сърцето чрез понижаване на кръвното налягане и холестерола.
        """,
            co2: """
            
            Карбонов отпечатък:
                            
            49 000 тона
                            
            Това е ниска стойност на карбоновия отпечатък от препоръчителна за плодове и зеленчуци - 120 000 тона. България е голям производител на диня.
            """,
            nutrition: ["127 kJ (30 kcal)","6.2 g","0.15 g","0.61 g","A, B1, B2, B3, B5, B6, C","Calcium, Iron, Magnasium, Manganese, Phosphorus, Potassium, Sodium, Zinc"]
        )
    ]
//}
